{
  "activation_function": "gelu_new",
  "architectures": [
    "ProGenForCausalLM"
  ],
  "attn_pdrop": 0.0,
  "bos_token_id": 1,
  "embd_pdrop": 0.0,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "model_type": "progen",
  "n_ctx": 1024,
  "n_embd": 256,
  "n_head": 16,
  "n_inner": null,
  "n_layer": 3,
  "n_positions": 1024,
  "resid_pdrop": 0.0,
  "rotary_dim": 64,
  "scale_attn_weights": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.1",
  "use_cache": true,
  "vocab_size": 30
}
